Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/government_in_ireland/security_and_emergency_services/fire_services.html.txt.tmx
Source language: en
Languages: ga

source: The Fire Services in Ireland are managed at local authority level, with the Department of Housing, Planning, Community and Local Government playing an advisory, legislative and policy-making role
ga: Tá na seirbhísí dóiteáin in Éirinn faoi bhainistíocht na n-údarás áitiúil, agus bíonn feidhm chomhairleach, reachtaíochta agus déanta cinntí ag an Roinn Tithíochta, Pleanála, Pobail agus Rialtais Áitiúil

source: The 30 fire services are operated by fire authorities, which are managed by local authorities around the State
ga: Tá na 30 seirbhís dóiteáin á bhfeidhmiú ag údarás dóiteáin, atá á mbainistiú ag na húdaráis áitiúla mórthimpeall an Stáit

source: The staff of the fire services runs 220 fire stations around the country and is made up of full-time professional fire fighters and retained part-time staff
ga: Reáchtálann foireann na seirbhísí dóiteáin 220 stáisiún dóiteáin timpeall na tíre agus tá lucht múchta dóiteáin lánaimseartha gairmiúil mar aon le foireann choimeádta pháirtaimseartha fosaithe acu

source: Retained staff, who make up about two-thirds of the national total, are recruited in rural areas, and are available for emergencies at all times
ga: Foireann choimeádta iad thart ar dhá thrian den fhoireann iomlán náisiúnta, agus déantar iad a earcú i gceantair thuaithe, agus bíonn fáil orthu le haghaidh éigeandála ag gach tráth

source: Cities and larger urban areas are serviced by full-time fire fighters, who work in shifts to provide a 24-hour on call service
ga: Soláthraíonn foireann dóiteáin lánaimseartha seirbhís do chathracha agus bailte níos mó, agus déanann siad sealobair chun seirbhís 24 uair ar ghlao-dhualgas a chur ar fáil

source: The Fire Services in Ireland receive funding from 3 sources:
ga: Tugtar cistiú do na Seirbhísí Dóiteáin in Éirinn ó 3 fhoinse:

source: Each local authority receives a fund from the Government to operate a fire service
ga: Faigheann gach údarás áitiúil ciste ón Rialtas chun seirbhís dóiteáin a fheidhmiú

source: This fund has replaced domestic rates
ga: Tháinig an ciste seo in ionad rátaí baile

source: The Government also gives funding to voluntary cave and mountain rescue groups and publishes the annual fire statistics for the country
ga: Ina theannta sin, tugann an Rialtas cistiú do ghrúpaí deonacha a chuireann seirbhís tarrthála pluaise agus sléibhe ar fáil, agus foilsíonn siad na staitisticí bliantúla dóiteáin don tír

source: Local authorities collect annual rates (charges) from commercial premises
ga: Bailíonn údaráis áitiúla rátaí bliantúla (muirir) ó áitribh thráchtála

source: These rates are designed to cover the cost of local authority services to businesses, including the provision of fire services
ga: Gearrtar na rátaí seo chun íoc as costas sheirbhísí an údaráis áitiúil a sholáthraítear do ghnólachtaí, lena n-áirítear soláthar seirbhísí dóiteáin

source: Local authorities are permitted under the Fire Services Acts to charge for fire services and the majority of local authorities impose charges
ga: Ceadaítear d’údaráis áitiúla, faoi na hAchtanna Seirbhísí Dóiteáin, chun muirear a ghearradh ar sheirbhísí dóiteáin agus gearrann tromlach na n-údarás áitiúil muirir

source: For example, some local authorities charge a flat fee for domestic fires like chimney fires, and may seek the actual cost to them of commercial fires, forestry fires, false alarms and instances that require the use of special equipment
ga: Mar shampla, gearrann roinnt údaráis áitiúla buntáille ar dhóiteáin tí, ar nós dóiteáin simléir, agus féadtar an costas iomlán a lorg i gcás tinte tráchtála, tinte foraoise, aláraim bhréige agus cásanna inar gá trealamh speisialta a úsáid

source: However, there is not a uniform set of fire services charged for or a uniform set of charge rates
ga: Ní ann, áfach, do shraith aonfhoirmeach seirbhísí dóiteáin a ghearrtar nó sraith aonfhoirmeach rátaí muirir

source: Fire authorities also charge for fire service inspections
ga: Anuas air sin, gearrann údaráis dóiteáin muirear ar iniúchtaí seirbhís dóiteáin

source: These charges can vary between local authorities and can also vary with the nature of the premises being inspected
ga: Féadfaidh na muirir seo a bheith éagsúil ó údarás áitiúil go húdarás áitiúil, agus féadfaidh siad a bheith athraitheach, freisin, ag brath ar chineál an áitribh ar a bhfuil iniúchadh á dhéanamh

source: The Department’s National Directorate for Fire and Emergency Management has been assigned the Department’s role in the promotion of fire safety and fire prevention on a national level
ga: Sannadh feidhm na Roinne don Stiúrthóireacht Náisiúnta do Bhainistiú Dóiteáin agus Éigeandála maidir le cur chun cinn na sábháilteachta dóiteáin agus an choisc ar dhóiteáin ar leibhéal náisiúnta

source: It works closely with fire authorities around the country to achieve this aim and also co-operates with the Northern Ireland Fire and Rescue Service
ga: Dlúthoibríonn siad le húdaráis dóiteáin timpeall na tíre chun an cuspóir seo a bhaint amach agus comhoibríonn siad le Seirbhís Dóiteáin agus Tarrthála Thuaisceart Éireann, chomh maith

source: The main focus of promotional activities centres on the National Fire Safety Week, which takes place in early October
ga: Díríonn na ngníomhaíochtaí um chur chun cinn go príomha ar Sheachtain Náisiúnta na Sábháilteachta Dóiteáin, a thiteann amach go luath i nDeireadh Fómhair

source: Training is provided at national and at local level at centres around the country
ga: Cuirtear oiliúint ar fáil ar leibhéal náisiúnta agus áitiúil in ionaid timpeall na tíre

source: One of the functions of the National Directorate is to support the training of fire services personnel
ga: Ar cheann d’fheidhmeanna na Stiúrthóireachta Náisiúnta tá tacú le hoiliúint na bpearsanra seirbhísí dóiteáin

source: It operates an annual training programme
ga: Feidhmítear clár bliantúil oiliúna

source: The largest training centre in Ireland is the Dublin Fire Brigade Training Centre, which offers courses in fire safety and fire safety management to companies outside the fire services
ga: Is é an t-ionad oiliúna is mó in Éirinn Ionad Oiliúna Briogáid Dóiteáin Bhaile Átha Cliath, a chuireann cúrsaí ar fáil i sábháilteacht dóiteáin agus bainistíocht sábháilteacht dóiteáin do chuideachtaí lasmuigh de na seirbhísí dóiteáin

source: Fire service powers at the scene of a fire
ga: Cumhachtaí na seirbhíse dóiteáin ag láthair dhóiteáin

source: The Commanding Officer at the scene of an emergency is empowered by the Fire Services Act 1981 (as amended by Part 3 of the Licensing of Indoor Events Act 2003) to do or command his/her fire-fighters or other personnel to do whatever is necessary or appropriate to put out the fire or protect or rescue persons involved in the emergency
ga: Tá an chumhacht ag an oifigeach ceannais ag láthair éigeandála faoin Acht um Sheirbhísí Dóiteáin, 1981 (arna leasú ag Cuid 3 den Acht um Cheadúnú Ócáidí Laistigh, 2003) rud ar bith a dhéanamh, nó orduithe a thabhairt dá lucht múchta dóiteáin nó do phearsanra eile rud ar bith a dhéanamh is gá chun an tine a mhúchadh nó chun daoine a chosaint nó a shábháil atá bainteach san éigeandáil

source: In the event of a fire or a suspected fire, the Commanding Officer's powers include:
ga: I gcás dóiteán amhrasta, áirítear le cumhachtaí an Oifigigh Cheannais:

source: • The power to enter any property where there is reason to believe a fire has broken out
ga: • An chumhacht chun aon mhaoin a iontráil, sa chás go gcreidtear go bhfuil dóiteán tar éis tosú

source: • The power to evacuate any building
ga: • An chumhacht chun aon fhoirgneamh a aslonnú

source: • The power to demolish any building or part of a building
ga: • An chumhacht chun aon fhoirgneamh nó cuid d’fhoirgneamh a scartáil

source: • The power to take a water supply from any public, private, natural or artificial source
ga: • An chumhacht chun soláthar uisce a ghlacadh ó aon fhoinse phoiblí, phríobháideach, nádúrtha nó shaorga

source: Fire fighters are immune from legal action in the course of their duties within the Act's provisions
ga: Tá múchtóirí dóiteáin díolmhaithe ó chaingean dlí i gcúrsa a ndualgas laistigh d’fhorálacha an Achta

source: Offences under the Fire Services Acts and Criminal Justice Act 2006
ga: Ciontuithe faoi na hAchtanna um Sheirbhísí Dóiteáin agus an tAcht um Cheartas Coiriúil, 2006

source: Under the Fire Services Acts 1981 and 2003, it is an offence to:
ga: Faoi na hAchtanna um Sheirbhísí Dóiteáin 1981 agus 2003, is cion é:

source: • Knowingly give a false alarm to the fire services
ga: • Aláram bréige a thabhairt go feasach do na seirbhísí dóiteáin

source: • Interfere with or obstruct any water hydrant or other source of water supply
ga: • Cur isteach ar nó cosc a chur ar aon bhéal tuile nó ar aon fhoinse eile de sholáthar uisce

source: The penalty for these offences can be a fine of up to €3,000 or a prison sentence of up to 6 months or both
ga: D’fhéadfaí fíneáil a mhéid le €3,000 nó téarma príosúin a ghearradh ar feadh tráth nach faide ná 6 mhí nó an dá mar phionós ar na cionta seo

source: More serious offences, such as contravening fire safety regulations in relation to
ga: Féadtar pionós mar gheall ar chionta níos tromchúisí, ar nós rialacháin um shábháilteacht dóiteáin a shárú maidir le

source: • The size, design and use of buildings
ga: • Méid, dearadh agus úsáid foirgneamh

source: • The provision of adequate fire escape facilities
ga: • Áiseanna leordhóthanacha éalaithe dóiteáin a sholáthar

source: • The maximum number of occupants allowed under the regulations
ga: • An líon uasta áititheoirí a cheadaítear faoi na rialacháin

source: may be punished on conviction on indictment with a fine of up to €130,000 or a prison sentence of up to 2 years or both
ga: a ghearradh ar ciontú ar dhíotáil le fíneáil a mhéid le €130,000 nó téarma príosúin nach faide ná 2 bhliain a ghearradh nó an dá rud

source: Section 185 of the Criminal Justice Act 2006 makes it an offence to assault or threaten to assault fire brigade personnel during the execution of their duties
ga: Cion atá ann i gcomhréir le hAlt 185 den Acht um Cheartas Coiriúil, 2006 pearsanra briogáid dóiteáin a ionsaí nó bagairt orthu fad a thugann siad faoina gcuid dualgas

source: The penalty for this offence is a fine of up to €5,000 or 7 years in prison (or both)
ga: D’fhéadfaí fíneáil a mhéid le €5,000 nó téarma príosúin a ghearradh ar feadh tráth nach faide ná 7 mbliana (nó an dá rud) mar phionós ar an gcion seo

source: It is also an offence to obstruct or impede fire brigade personnel from carrying out their duties
ga: Anuas air sin, is cion é cosc no bac a chur ar phearsanra briogáid dóiteáin tabhairt faoina gcuid dualgas

source: This offence carries a fine of €2,500 and/or 6 months in prison
ga: Gearrfar fíneáil a mhéid le €2,500 agus/nó 6 mhí sa phríosún mar gheall ar an gcion seo

source: The Building Control Regulations 1997 to 2013 provide, among other things, for a system of Fire Safety Certificates to show that building designs comply with fire safety requirements
ga: Déanann na Rialacháin um Rialáil Foirgníochta, 1997-2013 forálacha, i measc rudaí eile, do chóras Teastais Sábháilteacht Dóiteáin lena léiriú go gcomhlíonann dearaí foirgnimh na rialacháin sábháilteacht dóiteáin

source: Developers of every new building, with the exception of domestic buildings, are required to obtain a Fire Safety Certificate
ga: Ceanglaítear ar fhorbróirí gach foirgnimh nua, seachas foirgnimh thí, Teastas Sábháilteacht Dóiteáin a fháil

source: Although there are different certificates for different kinds of development, it is necessary for every developer to send their plans and designs to their local fire authority
ga: Cé gurb ann do theastais éagsúla do shaghsanna éagsúla forbartha, is gá do gach forbróir a bpleananna agus dearaí a chur faoi bhráid a n-údaráis áitiúil dóiteáin

source: Developers' plans are inspected by senior fire services staff who ensure that adequate escape facilities are present and that the building is designed in a way that prevents and limits the spread of a fire
ga: Déanann foireann shinsearach na seirbhísí dóiteáin iniúchadh ar phleananna an fhorbróra, a chinntíonn go bhfuil áiseanna leordhóthanacha éalaithe dóiteáin ann agus gur dearadh an foirgneamh ar bhealach a chuireann cosc agus teorainn ar leathadh dóiteáin

source: If they are satisfied, a certificate is then issued by the building control authority
ga: Má bhíonn siad sásta, eisíonn an t-údarás um rialáil foirgníochta teastas

source: Under the provisions of the Fire Services Acts authorised inspectors from the fire services can visit and inspect any building within their jurisdiction
ga: Faoi fhorálacha na nAchtanna um Sheirbhísí Dóiteáin, féadfaidh iniúchóirí údaraithe ó na seirbhísí dóiteáin cuairt a thabhairt ar aon fhoirgneamh agus é a iniúchadh atá laistigh dá ndlínse

source: They may ask for any of the following details:
ga: Féadfaidh siad iarraidh ar aon chinn de na sonraí a leanas:

source: • The number of employees or occupants in the building
ga: • Líon na bhfostaithe nó na n-áititheoirí san fhoirgneamh

source: • The purpose of any room or area in the building
ga: • Cuspóir aon seomra nó limistéir san fhoirgneamh

source: • The materials used in the building's construction
ga: • Na hábhair a úsáideadh i dtógáil an fhoirgnimh

source: • Any official documents relating to the building's safety
ga: • Aon cháipéisí oifigiúla a bhaineann le sábháilteacht an fhoirgnimh

source: The inspectors can also examine the water supply and are permitted to bring any necessary equipment with them onto a site and examine or test any heating, lighting or ventilation systems and any substances used or stored within a premises
ga: Sa bhreis air sin, féadfaidh na hiniúchóirí scrúdú a dhéanamh ar an soláthar uisce agus ceadaítear dóibh aon trealamh riachtanach a thabhairt leo ar shuíomh agus chun scrúdú nó tástáil a dhéanamh ar aon chórais téimh, soilsithe nó aeraithe mar aon le haon substaintí a úsáidtear nó a stóráiltear laistigh d’áitreabh

source: Owners of property can be asked by a fire services inspector to provide drawings or plans of buildings under their ownership
ga: Féadfaidh iniúchóir seirbhísí dóiteáin iarraidh ar úinéirí maoine líoníochtaí nó pleananna foirgneamh a sholáthar atá faoina n-úinéireacht

source: The owner is legally obliged to provide a satisfactory response to the inspector
ga: Tá dualgas dlíthiúil ar an úinéir chun freagra sásúil a sholáthar don iniúchóir

source: If the inspector is not happy with what he or she finds, he/she can make an application to the High Court for an order requiring the removal, alteration or making safe of any structure, service, fitting or piece of equipment or an order restricting construction work at the site or prohibiting the use of a building until the required changes have been made
ga: Mura bhfuil an t-iniúchóir sásta leis an méid a aimsíonn sé/sí, féadfaidh sé/sí iarratas a dhéanamh ar an Ard-Chúirt ar ordú a cheanglaíonn go mbaintear, go n-athraítear nó go n-athraítear aon struchtúr, seirbhís feisteas nó píosa trealaimh chun sábháilteachta nó ar ordú a chuireann cosc ar obair foirgníochta ar an suíomh nó a chuireann cosc ar úsáid foirgnimh go dtí go ndéantar na hathruithe riachtanacha

source: If the High Court grants such an order, its terms are legally binding on the owner of the building or site
ga: Má dheonaíonn an Ard-Chúirt an t-ordú sin, tá a téarmaí ina gceanglas dlí ar úinéir an fhoirgnimh nó an tsuímh

source: Offenders can face a fine of up to €3,000 and/or up to six months imprisonment
ga: D’fhéadfaí fíneáil a mhéid le €3,000 agus/nó príosúnacht a mhéid le sé mhí a ghearradh ar chiontóirí

source: If a fire services inspector is refused entry, obstructed or impeded in his or her duties, it is considered a criminal offence that is punishable by a fine of up to €3,000 and/or six months imprisonment
ga: Má dhiúltaítear cead isteach d’iniúchóir seirbhísí dóiteáin nó má chuirtear cosc nó bac air/uirthi tabhairt faoina c(h)uid dualgas, meastar gurb ionann seo agus cion coiriúil agus féadtar fíneáil a mhéid le €3,000 agus/nó príosúnacht sé mhí a ghearradh mar phionós air seo

source: A fire services inspector can apply to the District Court for a warrant if he/she is refused entry to a building or site
ga: Féadfaidh iniúchóir seirbhísí dóiteáin iarratas a dhéanamh ar an gCúirt Dúiche do bharántas má dhiúltaítear cead isteach a thabhairt dó/di ar fhoirgneamh nó ar shuíomh

source: The fire services also have a role in ensuring compliance with the Dangerous Substances Act, 1972 and Dangerous Substances (Retail and Private Petroleum Stores) Regulations 1979 (SI 311 of 1979)
ga: Ina theannta sin, tá feidhm ag na seirbhísí dóiteáin maidir le comhlíonadh an Achta um Shubstaintí Contúirteacha, 1972 agus na Rialachán um Shubstaintí Contúirteacha (Stórais Pheitriliam Mhiondíola agus Phríobháideacha), 1979 (IR 311 de 1979) a chinntiú

source: For example, those in possession of more than 273 litres of petrol must apply for a licence for the storage of petrol
ga: Mar shampla, ní mór dóibh siúd a bhfuil breis agus 273 lítear peitril acu iarratas a dhéanamh ar cheadúnas le haghaidh stóráil peitril

source: Applicants have to submit copies of Ordnance Survey maps of the area and architects' plans of the site and any buildings on the site to their local authority
ga: Tá ar iarratasóirí cóipeanna de léarscáileanna Suirbhéireachta Ordanáis agus pleananna suímh agus aon fhoirgneamh ar an suíomh de chuid an ailtire a chur faoi bhráid a n-údaráis áitiúil

source: This information is necessary so that the fire services can ensure that dangerous substances, most commonly large amounts of petrol at petrol stations and industrial sites, are stored safely and kept at a reasonable distance from other buildings
ga: Teastaíonn an fhaisnéis seo ionas gur féidir leis na seirbhísí dóiteáin a chinntiú go stóráiltear go sábháilte substaintí contúirteacha, méideanna móra peitril ag stáisiúin pheitril agus suíomhanna tionsclaíocha, i bhformhór na gcásanna, agus go gcoimeádtar iad ag fad réasúnta amach ó fhoirgnimh eile

source: There is more information on the Health and Safety Authority’s website
ga: Tá tuilleadh faisnéise le fáil ar láithreán gréasáin an Údaráis Sláinte agus Sábháilteachta

source: In February 2013, the Department of Housing, Planning, Community and Local Government published a major policy document for the fire services entitled Keeping Communities Safe - a framework for fire safety in Ireland (pdf)
ga: I bhFeabhra 2013, d’fhoilsigh an Roinn Tithíochta, Pleanála, Pobail agus Rialtais Áitiúil mórcháipéis bheartais do na seirbhísí dóiteáin dar teideal Pobail a Choimeád Sábháilte – creatlach le haghaidh sábháilteacht dóiteáin in Éirinn (‘Keeping Communities Safe - a framework for fire safety in Ireland’) (pdf)

source: It covers a number of issues including reform of service delivery structures and the roles of the fire services
ga: Cuimsíonn sí líon saincheisteanna, lena n-áirítear athchóiriú na struchtúr seachadta seirbhíse agus feidhmeanna na seirbhísí dóiteáin

source: The number of fire services is to be reduced from the current 30 fire services to 21, based on developing and extending the “shared services” approach already used by a number of fire authorities
ga: Tá an líon seirbhísí dóiteáin le laghdú ó na 30 stáisiún reatha go dtí 21 stáisiún, bunaithe ar chur chuige “na gcomhsheirbhísí” a fhorbairt agus a shíneadh atá in úsáid cheana féin ag líon údaráis dóiteáin

source: The number used for emergency calls across Europe -112 - has now been introduced in Ireland and replaces the traditional call number for emergency services in Ireland - 999
ga: Tugadh isteach an uimhir a úsáidtear le haghaidh glaonna éigeandála ar fud na hEorpa – 112 – in Éirinn anois agus cuirtear an uimhir seo in ionad na huimhreach traidisiúnta chun glao a chur ar na seirbhísí éigeandála in Éirinn – 999

source: Dialling either number will get you through to the emergency services in Ireland
ga: Má dhéantar tú ceachtar uimhir a iontráil, cuirfear ar aghaidh thú chuig na seirbhísí éigeandála in Éirinn

source: Application forms for Fire Safety Certificates are available from your local fire authority or your local fire station
ga: Tá fáil ar fhoirmeacha iarratais ar Theastais Sábháilteacht Dóiteáin ó d’údarás dóiteáin áitiúil nó ó do stáisiún áitiúil dóiteáin

source: Contact details for each fire authority can be found on the Department of Housing, Planning, Community and Local Government's web site
ga: Is féidir teacht ar shonraí teagmhála le haghaidh gach údaráis dóiteáin ar láithreán gréasáin na Roinne Tithíochta, Pleanála, Pobail agus Rialtais Áitiúil

source: You will also find further information and codes of practice on fire safety on the Department's website
ga: Tiocfaidh tú ar thuilleadh faisnéise agus ar chóid chleachtais ar shábháilteacht dóiteáin i mír Fhoilseacháin na Seirbhísí Dóiteáin ar láithreán gréasáin na Roinne
